[{"title": "ResuMate Pro: Revolutionizing Resume Review with Gemini-Powered Multimodal Analysis", "link": "https://medium.com/google-cloud/resumate-pro-revolutionizing-resume-review-with-gemini-powered-multimodal-analysis-6fcef20e7462?source=rss----e52cf94d98af---4", "summary": "Resumate Pro, an applicant tracking system, leverages Gemini's multimodal analysis to revolutionize resume review.  It builds upon the features of Resumate Lite by adding interview, send-out, acceptance, and offer tracking.  This enhanced system provides a comprehensive and organized approach to the entire recruitment process.\n"}, {"title": "Deploying OAuth2-Proxy as a Cloud Run sidecar container", "link": "https://medium.com/google-cloud/deploying-oauth2-proxy-as-a-cloud-run-sidecar-container-a06172d14e1f?source=rss----e52cf94d98af---4", "summary": "This article demonstrates securing a Cloud Run web application using OAuth2 without modifying the application code.  It achieves this by deploying an OAuth2-Proxy container as a sidecar, configuring the OAuth2 flow with a Google OAuth provider, and injecting the sidecar into the Cloud Run application.  The example is a demo and not intended for production use.\n"}, {"title": "How to Convert AI Tokens to Google Gemini Cost Estimates", "link": "https://medium.com/google-cloud/how-to-convert-ai-tokens-to-google-gemini-cost-estimates-5c199a4f04fe?source=rss----e52cf94d98af---4", "summary": "Estimating Google Gemini AI costs involves converting text into tokens using a rule of thumb (1 token = 4 characters).  OpenAI offers a tokenizer tool to estimate token counts.  Gemini's pricing is then calculated based on these tokens, with different costs for input and output tokens.\n"}, {"title": "Extract JSON Data from Text using Gemini", "link": "https://medium.com/google-cloud/extract-json-data-from-text-using-gemini-dc01dec17211?source=rss----e52cf94d98af---4", "summary": "This article demonstrates using Google's Gemini to extract information from unstructured text and format it as a JSON object.  The example focuses on analyzing drug overdose reports, extracting over 200 data points to create structured data for researchers.  This automated process improves efficiency and accuracy in identifying trends and risk factors.\n"}]